[
  {
    "id": "prod-1",
    "name": "Azure Dream Vase",
    "artisanId": "art-1",
    "categoryId": "pottery",
    "price": 85,
    "rating": 4.8,
    "reviewCount": 124,
    "description": "A hand-thrown stoneware vase, glazed in a deep, vibrant azure that evokes the summer sky. Each piece is unique, with slight variations in color and form that speak to its handmade nature.",
    "story": "Elena sculpted this vase during a quiet sunrise, inspired by the shifting colors of the dawn. It's meant to hold a piece of the outdoors, bringing tranquility and nature's beauty into your home.",
    "imageIds": [
      "product-ceramic-vase",
      "gallery-1"
    ]
  },
  {
    "id": "prod-2",
    "name": "Forest-Heart Bowl",
    "artisanId": "art-2",
    "categoryId": "woodwork",
    "price": 120,
    "rating": 4.9,
    "reviewCount": 98,
    "description": "Carved from a single piece of sustainably sourced maple, this bowl features a live edge that follows the natural contour of the tree. It is finished with a food-safe oil to highlight the wood's rich grain.",
    "story": "Samuel believes every piece of wood has a story. This bowl comes from a fallen maple in a local forest. He worked to preserve its spirit, creating a functional piece of art that connects you to the woods.",
    "imageIds": [
      "product-wooden-bowl",
      "gallery-2"
    ]
  },
  {
    "id": "prod-3",
    "name": "Sunset Weaver Scarf",
    "artisanId": "art-3",
    "categoryId": "textiles",
    "price": 65,
    "rating": 4.7,
    "reviewCount": 210,
    "description": "A lightweight and incredibly soft scarf, hand-woven from a blend of merino wool and silk. The colors transition from warm orange to deep indigo, mirroring a desert sunset.",
    "story": "Aisha's weaving is a form of meditation. The pattern of this scarf is a traditional design from her village, passed down through generations. Each thread is a word in a story of heritage and warmth.",
    "imageIds": [
      "product-woven-scarf",
      "gallery-3"
    ]
  },
  {
    "id": "prod-4",
    "name": "Tidal Moon Necklace",
    "artisanId": "art-4",
    "categoryId": "jewelry",
    "price": 150,
    "rating": 4.9,
    "reviewCount": 75,
    "description": "A minimalist sterling silver necklace featuring a hammered crescent moon pendant and a small, shimmering moonstone. The chain is delicate yet strong, perfect for everyday wear.",
    "story": "Marco is fascinated by the cosmos. This necklace is his interpretation of the moon's pull on the tides. The hammered texture catches the light like moonlight on water, a small piece of the night sky to carry with you.",
    "imageIds": [
      "product-silver-necklace",
      "gallery-4"
    ]
  },
  {
    "id": "prod-5",
    "name": "The Story-Keeper Journal",
    "artisanId": "art-2",
    "categoryId": "woodwork",
    "price": 75,
    "rating": 4.8,
    "reviewCount": 150,
    "description": "A rustic, refillable journal bound in supple, full-grain leather and hand-stitched with durable waxed linen thread. Features 200 pages of high-quality, acid-free paper.",
    "story": "Samuel also works with leather, seeing it as another natural canvas. He designed this journal to be a lifelong companion, aging beautifully and collecting stories alongside its owner.",
    "imageIds": [
      "product-leather-journal",
      "gallery-5"
    ]
  },
  {
    "id": "prod-6",
    "name": "Nebula Sculpture",
    "artisanId": "art-1",
    "categoryId": "pottery",
    "price": 220,
    "rating": 5,
    "reviewCount": 30,
    "description": "A unique, hand-blown glass sculpture capturing the ethereal beauty of a distant nebula. Swirls of vibrant color are suspended in clear glass, creating a sense of depth and wonder.",
    "story": "Though known for pottery, Elena has a passion for glassblowing. This piece is from her 'Cosmos' series, an exploration of form and color inspired by deep space imagery. It's a reminder of the vast beauty that exists beyond our world.",
    "imageIds": [
      "product-glass-sculpture",
      "gallery-6"
    ]
  },
  {
    "id": "prod-1758284377211",
    "name": "Coding Canvas: Your Handcrafted Path to JavaScript Mastery",
    "artisanId": "art-1758280547422",
    "categoryId": "new",
    "price": 107,
    "rating": 0,
    "reviewCount": 0,
    "description": "Step into the elegantly structured world of digital creation with our 'Coding Canvas' learning journey. This meticulously curated teaching tool is not merely a collection of lessons, but a vibrant tapestry woven from clear explanations, practical examples, and engaging visual aids. Each module is polished to perfection, ensuring a seamless flow of knowledge, presented in a clean, intuitive interface designed for optimal learning and retention. We've poured over every 'pixel' of content, ensuring that the 'materials' – the core concepts of JavaScript and DOM manipulation – are robust, accessible, and beautifully interconnected, much like the finest threads in a master weaver's work.\r\n\r\nThe inspiration for 'Coding Canvas' sprang from a deep desire to demystify the art of programming, transforming complex code into an approachable, joyful craft. Like a potter shaping clay, our expert instructors have patiently molded each lesson, drawing upon years of hands-on experience and a passion for sharing knowledge. We believe that true understanding blossoms from clear guidance and genuine encouragement. This course is our heartfelt offering, born from countless hours of refining, testing, and imagining a learning experience that feels less like a task and more like a discovery—a personal mentorship distilled into an accessible, artisan-crafted educational journey.",
    "story": "Inspired by teaching tool, this piece is a new addition to my collection.",
    "imageIds": [
      "prod-img-1758284377208-338",
      "prod-img-1758284377210-609",
      "prod-img-1758284377211-329"
    ]
  },
  {
    "id": "prod-1758284571028",
    "name": "Heirloom Artisan Learning Blocks: A Tactile Path to Discovery",
    "artisanId": "art-1758280547422",
    "categoryId": "new",
    "price": 119,
    "rating": 0,
    "reviewCount": 0,
    "description": "Discover our exquisite set of Heirloom Artisan Learning Blocks, each piece a testament to enduring craftsmanship and thoughtful design. Meticulously hand-carved from sustainably sourced, premium maple wood, these blocks offer a wonderfully smooth, tactile experience, showcasing a rich, natural grain. Each surface is carefully etched with elegant letters, numbers, or symbols, rendered in a classic, legible typeface, ensuring both aesthetic beauty and educational clarity. A gentle, non-toxic beeswax finish protects the wood, imparting a soft, natural luster that promises durability for generations of inquisitive hands.\r\n\r\nConceived in our dedicated workshop, this collection draws inspiration from time-honored educational philosophies and the profound joy of foundational learning. We believe that true understanding blossoms through engagement, and the hands-on interaction with these heirloom-quality blocks is designed to ignite curiosity, foster problem-solving skills, and deepen a child's connection to the world of knowledge. Each set is lovingly crafted not just as a teaching tool, but as a cherished family treasure, destined to be passed down, carrying forward a legacy of discovery and intellectual growth.",
    "story": "Inspired by teaching tool, this piece is a new addition to my collection.",
    "imageIds": [
      "prod-img-1758284570968-213",
      "prod-img-1758284570988-551",
      "prod-img-1758284571028-667"
    ]
  },
  {
    "id": "prod-1758398800049",
    "name": "The Artisan Coder's Blueprint: Handcrafted Java & JavaScript Mastery",
    "artisanId": "art-1758398167859",
    "categoryId": "new",
    "price": 55,
    "rating": 0,
    "reviewCount": 0,
    "description": "Embark on a meticulously crafted digital journey designed to illuminate the art of programming. This comprehensive learning experience unfolds like a carefully curated collection, offering polished insights into both Java and JavaScript. Each module is a testament to clarity, breaking down intricate concepts from essential loops to dynamic DOM manipulation with visual elegance and accessible explanations, much like a master craftsman reveals the secrets of their trade.\r\n\r\nInspired by the profound satisfaction of guiding aspiring creators, this teaching resource was conceived to transform complex code into intuitive understanding. We believe in fostering a deep connection with the logic behind the syntax, patiently guiding you through challenges to cultivate genuine coding confidence. It's an invitation to develop not just skills, but a true artisan's appreciation for the elegance and power of well-structured software.",
    "story": "Inspired by teaching, this piece is a new addition to my collection.",
    "imageIds": [
      "prod-img-1758398800047-550",
      "prod-img-1758398800047-917",
      "prod-img-1758398800049-662"
    ]
  }
]